---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterInfo.GetReferenceNameForTopRail
source: html/debed542-13c9-f936-e01e-070d4b13dccf.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.GetReferenceNameForTopRail Method

Gets the name string to be used as a reference to Top Rail in the current language.

## Syntax (C#)
```csharp
public static string GetReferenceNameForTopRail()
```

## Returns
The name string to be used as a reference to Top Rail.

## Remarks
This name can be used in the setter for BaseReferenceName
 or TopReferenceName .
 The name can also be compared with the value coming from the getter.